"use strick"
alert("Рішення домашек в файлі JS, дякую за перевірку і гарного дня 😸")

// ===================================================================
// ? Домашня робота №1 - Оператори JAVASCRIPT
// ===================================================================

console.log("Домашня робота №1"); 

// Який чи які з варіантів не вірні

// ? Варіант №1 ======================================================
console.log('35' + - "22"); // Поверне 13
let task01 = '35' + - "22";
console.log(typeof task01);

// * Відповідь: НЕ ВІРНО.
// В консолі буде : 35-22. Унарний оператор "-" переводить строку "22" в число -22. В даному випадку бінарний оператор "+" зєднує
// строку та число, а ми знаємо що бінарний оператор "+" не переводить строки в числа і якщо в виразі є значення з типом данних строка, то весь вираз переводиться в 
// тип даних срока. Отримаємо значення "35-22", тип даних строка.

// ? Варіант №2 ======================================================
console.log('35' * "22"); // Поверне 770
let task02 = '35' * "22";
console.log(typeof task02);
// * Відповідь: ВІРНО. 
//Так поверне 770, тип даних число. Операто "*" переводить строки в числа. 

// ? Варіант №3 ======================================================
// console.log('588' > 22++); // Поверне true
// * Відповідь: НЕ ВІРНО, ВИКЛИЧЕ ПОМИЛКУ 
// Інкремент "++" так як і Декремент "--" не працює с числам, тільки зі змінами. Буде помилка в браузері. 
let task03 = 22;
console.log('588' > task03++);

// ?  Варіант №4 ======================================================
let userCounter = 0;
let newUser = userCounter++;
console.log(newUser); // Поверне 1
// * Відповідь: НЕ ВІРНО. Видасть 0, зміна newUser присвоїть старе значення зміної userCounter, а вже пісял цього відбудеться збільшення зміної 
// userCounter на 1.
// Оператори "++" і "--" можуть бути розташовані перед зміною і після. Коли перед зміної це префіксна форма, коли після зміної це постфіксна форма.
// Та і та форма збільшує значення зімної на 1, але префіксна форма повертає нове значення, тоді як постфіксна форма повертає старе (до збільшення/зменшення числа).


// ?  Варіант №5 ======================================================
console.log(!false && 11 || 18 && !''); // Поверне 18
// * Відповідь: НЕ ВІРНО. Видасть 11.
// Оператор "!" - ні. (Логічне НІ) Повертає false, якщо операнд може бути перетворений на true; інакше повертає true.
// Оператор "&&" - шукає перше false. Якщо всюди true, то поверне останє true.
// Оператор "||" - шукає перше true. Якщо всюди false, то поверне останє false.
// "!false" дасть true. Пуста строка буде false, але з оператором ! буде true.
// Отримаємо в першій частині true && true - поверне останє true - тобто 11
// Отримаємо в другій частині true && true - поверне останє true - тобто true =)
// 11 || true. Оператор шукає перше true і видасть 11. 

// ?  Варіант №6 ======================================================
let name = 0;
console.log(name ?? "Без имени");
// * Відповідь: Видасть 0.
//Оператор ?? - це перевірка зміної на значення Null / Undefined. Він перевіряє зміну name на Null / Undefined, якщо вони присутні то 
//виконується інша частина кода. Зміна name має значення - 0.


// ===================================================================
// ? Домашня робота №2 - IF ELSE в JAVASCRIPT
// ===================================================================

console.log("Домашня робота №2"); 

// Який із варіантів поверне в консоль слово "істина"

// ? Варіант №1 ======================================================
if (1 === "1") {
	console.log('Істина!');
} else {
	console.log('Брехня!');
}
// * Відповідь: Видасть Брехня!.
// Оператор суворої рівності "===" перевіряє рівність без наведення типів. 1 є тип Number, а "1" є тип String. Так як оператор суворої рівності
// не переводить значення в числа, а зрівнює за типом, то буде false. При умові false інструкція if не виконається, а виконається інша умов, тобто else. Брехня!

// ? Варіант №2 ======================================================
if (5 == "5") {
	console.log('Істина!');
} else {
	console.log('Брехня!');
}
// * Відповідь: Видасть Істина!.
// Оператор порівняння == переводить строки в числа. Строка "5" переведеться в число 5. 5 == 5 буде true, виконається код if.

// ? Варіант №3 ======================================================
let message = (92 > '11' && 58 < 100) ? 'Істина!' : 'Брехня!';
console.log(message);

// let messageSecond = 92 > '11' && 58 < 100;
// if (messageSecond) {
// 	console.log('Істина!');
// } else {
// 	console.log('Брехня!');
// }
// * Відповідь: Видасть Істина!.
// Оператор порівняння > переводить рядок в числа. Рядок '11' буде числом 11. В першій частині кода 92 більше 11 - це true, в другій частині кода 58 менше 100 - це також true.
// Оператор "&&" - шукає перше false. Якщо всюди true, то поверне останє true.
// Маємо true, виконається перше значення - 'Істина!'.
// Умовний оператор „?“ дає нам можливість скоротити код умовного розгалуження. 
// Сенс оператора „?“ – повернути те чи інше значення залежно від умови. Коли потрібно виконати різні гілки коду, використовуємо if.

// ? Варіант №4 ======================================================
if (0) {
	console.log('Брехня!');
} else {
	console.log('Істина!');
}
// * Відповідь: Видасть Істина!.
// 0 в умові до інструкції if повертає false. А при false ми небіжемо нікуди, тільки при true. Ой це з уроку запамяталося =)
// При false інструкції if не виконається, а виконається код інструкції else - тобто в консолі видасть - Істина!

// ===================================================================
// ? Домашня робота №3  - Цикли FOR та WHILE
// ===================================================================

console.log("Домашня робота №3"); 

// ? Завдання №1 ======================================================
// Вивести у консоль числа від 1 до 5 усіма циклами
// Відповідь :
// Цикл While
console.log ("Цикл While");
let num = 1;
while (num < 6) {
	console.log (num);
	num++;
}
// Цикл Do While
console.log ("Цикл Do While");
let numSecond = 1;
do {
	console.log (numSecond);
	numSecond++;
} while (numSecond < 6)
// Цикл For
console.log ("Цикл For");
for (let i = 1; i < 6; i++) {
	console.log (i);
}

// ? Завдання №2 ======================================================
// let num = 8;
// while (num) {
	// Останій результат 0, вірно ?
// 	console.log(num);
// 	num--;
// }
console.log("🙀")

let numThird = 8;
while (numThird) {
	// Останій результат 0, вірно ?
	console.log(numThird);
	numThird--;
}
// * Відповідь: НЕ ВІРНО! Останій результат 1.
// Зміна numThird буде зменшуватися з 8 до 0. А якщо в умові цикла 0 - це false. При false цикл не буде працювати. Тому він перестанє працювати на 1.


// ? Завдання №3 ======================================================
console.log("🙀")
// Переписати на while
for (let num = 0; num < 3; num++) {
	console.log(`Число: ${num}`)
}
console.log("🙀")
let numFourth = 0;
while (numFourth < 3) {
	console.log(`Число: ${numFourth}`);
	numFourth++;
}

// ? Завдання №4 ======================================================
// Припинити роботу циклу №1 коли size дорівнює 1
console.log("🙀")
// Цикл №1
for(let num = 0; num < 2; num++) {
	// Цикл №2
	for (let size = 0; size < 3; size++) {
		console.log(size);
	}
}
console.log("🙀")
breakCycle: for (let num = 0; num < 2; num++) {
					for (let size = 0; size < 3; size++) {
						if (size == 1) break breakCycle;
						console.log(size);
	}
}

// ===================================================================
// ? Домашня робота №4 - Числа в JAVASCRIPT
// ===================================================================

console.log("Домашня робота №4");

// ? Завдання №1 ======================================================

// Отримати значення округлення
let numOne = Math.round(1.005 * 100) / 100;
console.log (numOne); // Виведе 1 що не вірно
// Рішення
let someVar = 1.005 + Number.EPSILON;
let numFifth = Math.round(someVar * 100) / 100;
console.log (numFifth);
// Так в JS є математичні похибки. Як каже Женя процес доволі складний, буду в майбутьному розбиратися що тут за математика.
// Тому правильного округлення, тобто використання Math.round, треба заздалегіть до числа добавити Number.EPSILON - це дуже маленьке число.
console.log (1.005*100);
// 100.49999999999 Окей мозок тримайся =)
// Math.round округляє до цілого числа, використовуючи значення після точки, тобто 4 (а вот взяти подумати машинка і взяв б наступне число). Тому і отримуємо 1, що не є вірно.

// ? Завдання №2 ======================================================

// Отримати число 135.58 з рядку
let value = "135.58px";

//Рішення
let newValue = parseFloat(value);
console.log(newValue);

//Для цього використовуються функції parseInt та parseFloat.
//Вони зчитають число з рядка. Якщо під час зчитування виникає помилка, вони повертають отримане до помилки число. Функція parseInt повертає ціле число, а parseFloat повертає число з плаваючою точкою.

// ? Завдання №3 ======================================================

// Побудувати вірне умовне розгалуження
// let value = 58 + "Фрілансер";
// if (написати відповідь) {
// 	console.log('Результат виразу NaN');
// }
// Рішення
let valueSecond = 58 + "Фрілансер";
console.log(valueSecond);
// Число плюс строка буде строка
console.log(typeof valueSecond);
console.log(Number (valueSecond));
// Number переведе рядок в число, якщо в рядку є тільки числа. В іншому випадку NaN.
// isNaN(value) перетворює значення на число і перевіряє чи є воно NaN. Якщо NaN то це true в іншому випадку false. При true ми біжемо.
if (isNaN(valueSecond)) {
	console.log('Результат виразу NaN');
}

// ? Завдання №4 ======================================================

// Знайти максимальне число з 10, 58, 39, -150, 0.

let task04 = Math.max (10, 58, 39, -150, 0);
console.log (task04);
// Метод Math.max() повертає найбільше число.

// ? Завдання №5 ======================================================

// Округлити число 58.585 до числа 58
// Відповідь

let task05 = Math.floor (58.585);
console.log (task05);

// Використовуємо Math.floor, так як він округляє до ближнього найменшого значення. 

// ===================================================================
// ? Домашня робота №5 - Рядки в JAVASCRIPT
// ===================================================================

console.log("Домашня робота №5");

// ? Завдання №1 ======================================================

// Чи вірний запис?
let fls = "фрілансер";
let text = 'Привіт! Я ${fls}';
// Очікуємо отримати Привіт! Я фрілансер
console.log(text);
// * Відповідь: НЕ ВІРНО! Видасть Привіт! Я ${fls}.
// Для того щоб використовувати значення інших зміних у нашому виразі, треба використовувати зворотні кавички "``".
let flsSecond = "фрілансер";
let textSecond = `Привіт! Я ${flsSecond}`;
console.log(textSecond);

// ? Завдання №2 ======================================================

// Отримати символ "н" рядка:
// let text = "фрілансер";
// Рішення

let textThird = "фрілансер";
// indexOf
console.log("🙀")
let textThirdNew = textThird.indexOf('н');
console.log(textThirdNew);
if (textThirdNew > 0) {
	console.log("В цьому слові є буква, яка нас цікавить");
} else {
	console.log("В цьому слові нема букви, яка нас цікавить =(");
}

// includes
console.log("🙀")
let textThirdNewSecond = textThird.includes('н');
console.log(textThirdNewSecond);
if (textThirdNewSecond) {
	console.log("В цьому слові є буква, яка нас цікавить");
} else {
	console.log("В цьому слові нема букви, яка нас цікавить =(");
}

// includes - з перетворенням значення в нижній регіст - в задачі цього нема, але якщо буде ? =)
console.log("🙀")
let searchText = "н";
let textThirdNewThird = textThird.toLowerCase().includes(searchText.toLowerCase());
console.log(textThirdNewThird);
if (textThirdNewThird) {
	console.log("В цьому слові є буква, яка нас цікавить");
} else {
	console.log("В цьому слові нема букви, яка нас цікавить =(");
}

// ? Завдання №3 ======================================================

// Вірно ?
// let text = 123 + "456";
// Очікуємо 579
// console.log(text);
// * Відповідь: НЕ ВІРНО! Видасть рядок 123456.
// Про бінарний + вже писав, не буду тут писати =)
let text03 = 123 + +"456";
console.log(text03);
// Так буде вірно.


// ? Завдання №4 ======================================================

// Отримати рядок в верхньому регістрі
// let text = "фрілансер";
// Рішення
let text04 = "фрілансер";
let var04 = text04.toUpperCase();
console.log(var04);
// Використовуємо метод toUpperCase().

// ? Завдання №5 ======================================================

// Отримати підрядок "лан" з :
// let text = "фрілансер";

let text05 = "фрілансер";
let searchString = 'лан';
if (text05.toLowerCase().includes(searchString.toLowerCase())) {
	console.log(`В слові ${text05} є підрядок ${searchString}`);
} else {
	console.log(`В слові ${text05} нема підрядка ${searchString} =(`);
}


// ? Завдання №6 ======================================================

// true чи false ?
// let text = "фрілансер";
// console.log(text.includes('лан', 4));

let text06 = "фрілансер";
console.log(text06.includes('лан', 4));
// Видасть false. функція считує рядок з 0 до кінця. 'лан' займає місце - 3, 4 , 5. 
console.log(text06.includes('лан', 3)); // буде true